app/controllers/pictures_controller.rb

  def myStories
    @stories = Story.where(user_id: current_user.id)
---
SELECT "stories".* FROM "stories" WHERE "stories"."user_id" = ?  [["user_id", 2]]