app/controllers/stories_controller.rb

  def create
    @story = Story.new(story_params.merge(user: current_user))


    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @story.update(story_params)
---
UPDATE "stories" SET "picture" = ?, "updated_at" = ? WHERE "stories"."id" = ?  [["picture", "https://i.blogs.es/4a9f20/huevos-benedictinos/840_560.jpg"], ["updated_at", "2021-06-27 00:59:59.205622"], ["id", 1]]